Revit 2027 API
BuiltInFailures.ConnectorFailures.FittingMustBeOnDuct Property
 The [Tap] must be attached to duct.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FittingMustBeOnDuct { get; }
Public Shared ReadOnly Property FittingMustBeOnDuct As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FittingMustBeOnDuct {
	FailureDefinitionId^ get ();
}
static member FittingMustBeOnDuct : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace